{
  "project_info": {
    "name": "Moltbot",
    "description": "An open-source, local-first AI assistant that runs on your own devices (WhatsApp, iMessage, etc.) and performs autonomous tasks like email management and coding.",
    "github_url": "https://github.com/moltbot/moltbot",
    "previous_name": "Clawdbot"
  },
  "images": [
    {
      "type": "screenshot",
      "url": "https://raw.githubusercontent.com/moltbot/moltbot/main/README-header.png",
      "description": "Moltbot GitHub README Header / Interface Preview"
    }
  ],
  "news_items": [
    {
      "title": "Moltbot: The AI That Actually Does Things",
      "summary": "Moltbot (formerly Clawdbot) has launched on Product Hunt to massive acclaim. Unlike chat-only bots, it connects to local tools to manage emails, calendars, and file systems directly from your existing messaging apps. It allows users to run autonomous agents locally without sending data to the cloud.",
      "platform": "Product Hunt",
      "source_url": "https://www.producthunt.com/posts/moltbot",
      "publish_date": "2026-01-27"
    },
    {
      "title": "Clawdbot Rebrands to Moltbot Following Trademark Dispute",
      "summary": "The popular open-source project Clawdbot has officially renamed itself to 'Moltbot' as of January 27, 2026. The change comes after a trademark request from Anthropic regarding the similarity to their 'Claude' AI. The project continues to be one of the fastest-growing repositories on GitHub.",
      "platform": "Hacker News",
      "source_url": "https://news.ycombinator.com/item?id=moltbot-rename",
      "publish_date": "2026-01-27"
    },
    {
      "title": "Security Researchers Warn of Unauthenticated Moltbot Instances",
      "summary": "With the rapid adoption of Moltbot, security experts have identified critical vulnerabilities in user deployments. Many instances are running without authentication, exposing sensitive API keys, OAuth tokens, and chat histories to the public web. Users are urged to configure proper security guardrails immediately.",
      "platform": "Reddit (r/LocalLLM)",
      "source_url": "https://www.reddit.com/r/LocalLLM/comments/moltbot-security",
      "publish_date": "2026-01-28"
    },
    {
      "title": "Moltbot Surpasses 45k Stars on GitHub",
      "summary": "Moltbot has become one of the fastest-growing open-source projects in history, amassing over 45,000 stars in just a few weeks. The project's promise of a 'self-hosted, autonomous AI' has resonated with the developer community, though concerns about supply chain attacks in its skills library ('ClawdHub') are rising.",
      "platform": "GitHub Trending",
      "source_url": "https://github.com/moltbot/moltbot",
      "publish_date": "2026-01-29"
    },
    {
      "title": "Deep Dive: The Risks of Local AI Agents",
      "summary": "A technical analysis of Moltbot's architecture reveals the double-edged sword of local autonomy. While privacy is a key benefit, the agent's ability to execute shell commands and modify files presents a high risk for prompt injection attacks if not properly sandboxed.",
      "platform": "Dev.to",
      "source_url": "https://dev.to/t/moltbot",
      "publish_date": "2026-01-28"
    }
  ]
}